/****************************************************************************************
 * 锟侥硷拷锟斤拷  锟斤拷osal_main.c
 * 锟斤拷锟斤拷    锟斤拷osal锟斤拷锟斤拷系统锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟节达拷锟侥硷拷锟斤拷锟斤拷锟斤拷
 * 锟斤拷锟斤拷平台锟斤拷
 * 锟斤拷姹�  锟斤拷
 ***************************************************************************************/
#include "application.h"

/******************************************************************************
 * @fn      main
 *
 * @brief   
 *
 * @param   
 *
 * @return
 *****************************************************************************/
int main(void)
{    
	//系统硬锟斤拷锟斤拷锟斤拷锟斤拷瘸锟绞硷拷锟�
	
	//锟斤拷止锟叫讹拷
    HAL_DISABLE_INTERRUPTS();

    //osal锟斤拷锟斤拷系统锟斤拷始锟斤拷
    osal_init_system();

	//锟斤拷锟斤拷锟斤拷锟斤拷
	osal_add_Task(Serial_Task_Init,Serial_Task_EventProcess,1);	
	//锟斤拷锟接碉拷锟斤拷锟斤拷统一锟斤拷锟叫筹拷始锟斤拷
	osal_Task_init();

	osal_mem_kick();

	//锟斤拷锟斤拷锟叫讹拷
	HAL_ENABLE_INTERRUPTS();	

	//锟斤拷锟矫筹拷始锟斤拷锟斤拷锟铰硷拷锟斤拷锟较碉拷锟斤拷锟揭拷远锟斤拷锟窖拷锟斤拷锟斤拷锟斤拷录锟斤拷锟斤拷诖锟斤拷锟斤拷锟�
	osal_start_reload_timer( Serial_TaskID, PRINTF_STR, 1000);

	//锟斤拷锟斤拷osal系统锟斤拷锟斤拷锟斤拷锟劫凤拷锟斤拷
	osal_start_system();
}



